Tekla.Structures.ModelInternal.GeometryExporter.GeometryType
The type of the geometry

Tekla.Structures.ModelInternal.GeometryExporter.GeometryType.FLAT_SECTION
A flat user defined section.

Tekla.Structures.ModelInternal.GeometryExporter.GeometryType.CYLINDRICAL_CURVED_SECTION
A curved section following a cylindrical geometry.